import Footer from "../components/FooterComp";
import { useEffect, useState } from "react";
import AccordionItem from "../components/Faq";
import Navbar from "../components/Navbar";
import AOS from "aos";
import "../css/about.css";
import "aos/dist/aos.css";
function About() {
  const questions = [
    {
      question: "ვინ ვართ ჩვენ?",
      answer:
        "ჩვენ ვართ ახალი საფეხბურთო აკადემია, რომელიც შექმნილია 6-დან 12 წლამდე ასაკის ბავშვებისთვის.ჩვენი მიზანია, რომ პატარა ფეხბურთის მოყვარულებს მივცეთ საშუალება განივითარონ ტექნიკური უნარები, სპორტული დისციპლინა და გუნდურობა. ჩვენი ტრენერები ზრუნავენ იმაზე, რომ ბავშვებმა იგრძნონ თავს უსაფრთხოდ, დაიმეგობრონ თანატოლებთან და სპორტი გახდეს მათთვის სასიამოვნო გამოცდილება. ⚽ ",
    },
    {
      question: "რამდენის წლისას შეუძლია დარეგისტრირება?",
      answer:
        "ჩვენ გუნდში დარეგისტრირება შეუძლიათ 6-დან 12 წლამდე ასაკის ბიჭებს, რომლებიც დაინტერესებული არიან ფეხბურთით და სურთ გახდნენ მეგობრული და სპორტული გარემოს ნაწილი.",
    },
    {
      question: "როგორ დავრეგისტრიდე?",
      answer:
        "მთავარ გვერდზე რეგისტრაციის ღილაკზე დაჭერით გადაგიყვანს სარეგისტრაციო გვერდზე ინფორმაციის შეყვანის შემდეგ ჩვენი ერთ-ერთი სტაფის წევრი დაგიკავშირდებათ და გაგაცნობთ დეტალებს",
    },

    {
      question: "სად ტარდება ვარჯიშები??",
      answer: "ვარჯიშები ტარდება [მოედნის/სპორტული სკოლის] ტერიტორიაზე",
    },
    {
      question: "უნდა ჰქონდეს ბავშვებს საკუთარი ინვენტარი?",
      answer:
        "სასურველია თავიდან სპორტული ფორმა და ფეხსაცმელი. ბურთებსა და სხვა საჭირო ინვენტარს გუნდი უზრუნველყოფს.",
    },
    {
      question: "შემიძლია ბავშვის მოყვანა საცდელ ვარჯიშზე?",
      answer:
        "დიახ! გთავაზობთ ერთ საცდელ ვარჯიშს, რათა ბავშვმა და მშობელმა უკეთ გაიგონ გარემო და პროცესი.",
    },
    {
      question: "რამდენია გადასახადი?",
      answer: "საგადასახადო დეტალებს მწვრთნელი ან გუნდის წევრი გაგაცნობთ.",
    },
  ];

  const [show, setShow] = useState(false);

  useEffect(() => setShow(true), []);
  useEffect(() => {
    AOS.init({ duration: 1000, once: true });
  }, []);

  const [openT, setOpen] = useState(null);

  return (
    <div>
      <Navbar />
      <div className="about-head">
        <div className="about-heading">
          <h1 data-aos="fade-up" data-aos-delay="200">
            ჩვენს შესახებ
          </h1>
        </div>
        <div className={`about-wrapper ${show ? " show" : ""}`}>
          <div className="about-text" data-aos="fade-up" data-aos-delay="200">
            <p data-aos="fade-up" data-aos-delay="200">
              ჩვენი ახალგაზრდული საფეხბურთო გუნდის
               მიზანია ფეხბურთის სწავლება, ფიზიკური
              განვითარება და გუნდური მუშაობის უნარის გაძლიერება. ბავშვები ინდივიდუალურად იქნებიან დაკვირვების
              ქვეშ და ისწავლიან ბურთის კონტროლს, პასს, დარტყმას, ტაქტიკას და
              გუნდურ თამაშს. ტრენინგები სახალისო და ინტერაქტიულია. რეგულარულად
              ვაწყობთ მეგობრულ მატჩებს, სადაც დიდი მნიშვნელობა ენიჭება სწორი
              თამაშისა და სპორტული ეთიკის დაცვას. მშობლები აქტიურად იქნებიან
              ჩართულები ბავშვების პროგრესში და ასევე მიიღებენ მონაწილეობას სახალისო ტრუნირებში. ჩვენი
              პრიორიტეტია თითოეული ბავშვის უნარების მაქსიმალური განვითარება და
              სპორტული გარემოს სიხალისე.
            </p>
          </div>

          <div className="faq" data-aos="fade-up" data-aos-delay="200">
            <h2>ხშირად დასმული კითხვები</h2>
            {questions.map((faq, idx) => (
              <AccordionItem
                key={idx}
                question={faq.question}
                answer={faq.answer}
                open={openT === idx}
                onClick={() => setOpen(openT === idx ? null : idx)}
              />
            ))}
          </div>
        </div>

        <Footer />
      </div>
    </div>
  );
}

export default About;
